jsnyder/python-on-a-chip/src/platform/pic24/common/pic24_pyports.c
  #if NUM_DIGITAL_PORTS >= 3
    #if defined(_ODCC0)  || defined(_ODC0)
      0x0001 |
    #endif
    #if defined(_ODCC1)  || defined(_ODC1)
      0x0002 |
    #endif
    #if defined(_ODCC2)  || defined(_ODC2)
      0x0004 |
    #endif
    #if defined(_ODCC3)  || defined(_ODC3)
      0x0008 |
    #endif
    #if defined(_ODCC4)  || defined(_ODC4)
      0x0010 |
    #endif
    #if defined(_ODCC5)  || defined(_ODC5)
      0x0020 |
    #endif
    #if defined(_ODCC6)  || defined(_ODC6)
      0x0040 |
    #endif
    #if defined(_ODCC7)  || defined(_ODC7)
      0x0080 |
    #endif
    #if defined(_ODCC8)  || defined(_ODC8)
      0x0100 |
    #endif
    #if defined(_ODCC9)  || defined(_ODC9)
      0x0200 |
    #endif
    #if defined(_ODCC10) || defined(_ODC10)
      0x0400 |
    #endif
    #if defined(_ODCC11) || defined(_ODC11)
      0x0800 |
    #endif
    #if defined(_ODCC12) || defined(_ODC12)
      0x1000 |
    #endif
    #if defined(_ODCC13) || defined(_ODC13)
      0x2000 |
    #endif
    #if defined(_ODCC14) || defined(_ODC14)
      0x4000 |
    #endif
    #if defined(_ODCC15) || defined(_ODC15)
      0x8000 |
    #endif
    0x0000,
  #endif 

  #if NUM_DIGITAL_PORTS >= 4
    #if defined(_ODCD0)  || defined(_ODD0)
      0x0001 |
    #endif
    #if defined(_ODCD1)  || defined(_ODD1)
      0x0002 |
    #endif
    #if defined(_ODCD2)  || defined(_ODD2)
      0x0004 |
    #endif
    #if defined(_ODCD3)  || defined(_ODD3)
      0x0008 |
    #endif
    #if defined(_ODCD4)  || defined(_ODD4)
      0x0010 |
    #endif
    #if defined(_ODCD5)  || defined(_ODD5)
      0x0020 |
    #endif
    #if defined(_ODCD6)  || defined(_ODD6)
      0x0040 |
    #endif
    #if defined(_ODCD7)  || defined(_ODD7)
      0x0080 |
    #endif
    #if defined(_ODCD8)  || defined(_ODD8)
      0x0100 |
    #endif
    #if defined(_ODCD9)  || defined(_ODD9)
      0x0200 |
    #endif
    #if defined(_ODCD10) || defined(_ODD10)
      0x0400 |
    #endif
    #if defined(_ODCD11) || defined(_ODD11)
      0x0800 |
    #endif
    #if defined(_ODCD12) || defined(_ODD12)
      0x1000 |
    #endif
    #if defined(_ODCD13) || defined(_ODD13)
      0x2000 |
    #endif
    #if defined(_ODCD14) || defined(_ODD14)
      0x4000 |
    #endif
    #if defined(_ODCD15) || defined(_ODD15)
      0x8000 |
    #endif
    0x0000,
  #endif 

  #if NUM_DIGITAL_PORTS >= 5
    #if defined(_ODCE0)  || defined(_ODE0)
      0x0001 |
    #endif
    #if defined(_ODCE1)  || defined(_ODE1)
      0x0002 |
    #endif
    #if defined(_ODCE2)  || defined(_ODE2)
      0x0004 |
    #endif
    #if defined(_ODCE3)  || defined(_ODE3)
      0x0008 |
    #endif
    #if defined(_ODCE4)  || defined(_ODE4)
      0x0010 |
    #endif
    #if defined(_ODCE5)  || defined(_ODE5)
      0x0020 |
    #endif
    #if defined(_ODCE6)  || defined(_ODE6)
      0x0040 |
    #endif
    #if defined(_ODCE7)  || defined(_ODE7)
      0x0080 |
    #endif
    #if defined(_ODCE8)  || defined(_ODE8)
      0x0100 |
    #endif
    #if defined(_ODCE9)  || defined(_ODE9)
      0x0200 |
    #endif
    #if defined(_ODCE10) || defined(_ODE10)
      0x0400 |
    #endif
    #if defined(_ODCE11) || defined(_ODE11)
      0x0800 |
    #endif
    #if defined(_ODCE12) || defined(_ODE12)
      0x1000 |
    #endif
    #if defined(_ODCE13) || defined(_ODE13)
      0x2000 |
    #endif
    #if defined(_ODCE14) || defined(_ODE14)
      0x4000 |
    #endif
    #if defined(_ODCE15) || defined(_ODE15)
      0x8000 |
    #endif
    0x0000,
  #endif 

  #if NUM_DIGITAL_PORTS >= 6
    #if defined(_ODCF0)  || defined(_ODF0)
      0x0001 |
    #endif
    #if defined(_ODCF1)  || defined(_ODF1)
      0x0002 |
    #endif
    #if defined(_ODCF2)  || defined(_ODF2)
      0x0004 |
    #endif
    #if defined(_ODCF3)  || defined(_ODF3)
      0x0008 |
    #endif
    #if defined(_ODCF4)  || defined(_ODF4)
      0x0010 |
    #endif
    #if defined(_ODCF5)  || defined(_ODF5)
      0x0020 |
    #endif
    #if defined(_ODCF6)  || defined(_ODF6)
      0x0040 |
    #endif
    #if defined(_ODCF7)  || defined(_ODF7)
      0x0080 |
    #endif
    #if defined(_ODCF8)  || defined(_ODF8)
      0x0100 |
    #endif
    #if defined(_ODCF9)  || defined(_ODF9)
      0x0200 |
    #endif
    #if defined(_ODCF10) || defined(_ODF10)
      0x0400 |
    #endif
    #if defined(_ODCF11) || defined(_ODF11)
      0x0800 |
    #endif
    #if defined(_ODCF12) || defined(_ODF12)
      0x1000 |
    #endif
    #if defined(_ODCF13) || defined(_ODF13)
      0x2000 |
    #endif
    #if defined(_ODCF14) || defined(_ODF14)
      0x4000 |
    #endif
    #if defined(_ODCF15) || defined(_ODF15)
      0x8000 |
    #endif
    0x0000,
  #endif 

  #if NUM_DIGITAL_PORTS >= 7
    #if defined(_ODCG0)  || defined(_ODG0)
      0x0001 |
    #endif
    #if defined(_ODCG1)  || defined(_ODG1)
      0x0002 |
    #endif
    #if defined(_ODCG2)  || defined(_ODG2)
      0x0004 |
    #endif
    #if defined(_ODCG3)  || defined(_ODG3)
      0x0008 |
    #endif
    #if defined(_ODCG4)  || defined(_ODG4)
      0x0010 |
    #endif
    #if defined(_ODCG5)  || defined(_ODG5)
      0x0020 |
    #endif
    #if defined(_ODCG6)  || defined(_ODG6)
      0x0040 |
    #endif
    #if defined(_ODCG7)  || defined(_ODG7)
      0x0080 |
    #endif
    #if defined(_ODCG8)  || defined(_ODG8)
      0x0100 |
    #endif
    #if defined(_ODCG9)  || defined(_ODG9)
      0x0200 |
    #endif
    #if defined(_ODCG10) || defined(_ODG10)
      0x0400 |
    #endif
    #if defined(_ODCG11) || defined(_ODG11)
      0x0800 |
    #endif
    #if defined(_ODCG12) || defined(_ODG12)
      0x1000 |
    #endif
    #if defined(_ODCG13) || defined(_ODG13)
      0x2000 |
    #endif
    #if defined(_ODCG14) || defined(_ODG14)
      0x4000 |
    #endif
    #if defined(_ODCG15) || defined(_ODG15)
      0x8000 |
    #endif
    0x0000,
  #endif 
 };







// Include appropriate ports file for the device in use.
// These definitions are then used below to map digital I/O ports to the
// corresponding analog and change notification pin
#if defined(__PIC24HJ128GP202__)

