jsnyder/python-on-a-chip/src/platform/pic24/common/pic24_pyports.c
#include "devices/pic24hj128gp202_pyports.h"

#elif defined(__PIC24HJ128GP204__)

#include "devices/pic24hj128gp204_pyports.h"

#elif defined(__PIC24HJ128GP206__)

#include "devices/pic24hj128gp206_pyports.h"

#elif defined(__PIC24HJ128GP210__)

#include "devices/pic24hj128gp210_pyports.h"

#elif defined(__PIC24HJ128GP306__)

#include "devices/pic24hj128gp306_pyports.h"

#elif defined(__PIC24HJ128GP310__)

#include "devices/pic24hj128gp310_pyports.h"

#elif defined(__PIC24HJ128GP502__)

#include "devices/pic24hj128gp502_pyports.h"

#elif defined(__PIC24HJ128GP504__)

#include "devices/pic24hj128gp504_pyports.h"

#elif defined(__PIC24HJ128GP506__)

#include "devices/pic24hj128gp506_pyports.h"

#elif defined(__PIC24HJ128GP510__)

#include "devices/pic24hj128gp510_pyports.h"

#elif defined(__PIC24HJ12GP201__)

#include "devices/pic24hj12gp201_pyports.h"

#elif defined(__PIC24HJ12GP202__)

#include "devices/pic24hj12gp202_pyports.h"

#elif defined(__PIC24HJ16GP304__)

#include "devices/pic24hj16gp304_pyports.h"

#elif defined(__PIC24HJ256GP206__)

#include "devices/pic24hj256gp206_pyports.h"

#elif defined(__PIC24HJ256GP210__)

#include "devices/pic24hj256gp210_pyports.h"

#elif defined(__PIC24HJ256GP610__)

#include "devices/pic24hj256gp610_pyports.h"

#elif defined(__PIC24HJ32GP202__)

#include "devices/pic24hj32gp202_pyports.h"

#elif defined(__PIC24HJ32GP204__)

#include "devices/pic24hj32gp204_pyports.h"

#elif defined(__PIC24HJ32GP302__)

#include "devices/pic24hj32gp302_pyports.h"

#elif defined(__PIC24HJ32GP304__)

#include "devices/pic24hj32gp304_pyports.h"

#elif defined(__PIC24HJ64GP202__)

#include "devices/pic24hj64gp202_pyports.h"

#elif defined(__PIC24HJ64GP204__)

#include "devices/pic24hj64gp204_pyports.h"

#elif defined(__PIC24HJ64GP206__)

#include "devices/pic24hj64gp206_pyports.h"

#elif defined(__PIC24HJ64GP210__)

#include "devices/pic24hj64gp210_pyports.h"

#elif defined(__PIC24HJ64GP502__)

#include "devices/pic24hj64gp502_pyports.h"

#elif defined(__PIC24HJ64GP504__)

#include "devices/pic24hj64gp504_pyports.h"

#elif defined(__PIC24HJ64GP506__)

#include "devices/pic24hj64gp506_pyports.h"

#elif defined(__PIC24HJ64GP510__)

#include "devices/pic24hj64gp510_pyports.h"

#elif defined(__PIC24F04KA200__)

#include "devices/pic24f04ka200_pyports.h"

#elif defined(__PIC24F04KA201__)

#include "devices/pic24f04ka201_pyports.h"

#elif defined(__PIC24F08KA101__)

#include "devices/pic24f08ka101_pyports.h"

#elif defined(__PIC24F08KA102__)

#include "devices/pic24f08ka102_pyports.h"

#elif defined(__PIC24F16KA101__)

#include "devices/pic24f16ka101_pyports.h"

#elif defined(__PIC24F16KA102__)

#include "devices/pic24f16ka102_pyports.h"

#elif defined(__PIC24F32KA101__)

#include "devices/pic24f32ka101_pyports.h"

#elif defined(__PIC24F32KA102__)

#include "devices/pic24f32ka102_pyports.h"

#elif defined(__PIC24FJ128GA006__)

#include "devices/pic24fj128ga006_pyports.h"

#elif defined(__PIC24FJ128GA008__)

#include "devices/pic24fj128ga008_pyports.h"

#elif defined(__PIC24FJ128GA010__)

#include "devices/pic24fj128ga010_pyports.h"

#elif defined(__PIC24FJ128GA106__)

#include "devices/pic24fj128ga106_pyports.h"

#elif defined(__PIC24FJ128GA108__)

#include "devices/pic24fj128ga108_pyports.h"

#elif defined(__PIC24FJ128GA110__)

#include "devices/pic24fj128ga110_pyports.h"

#elif defined(__PIC24FJ128GB106__)

#include "devices/pic24fj128gb106_pyports.h"

#elif defined(__PIC24FJ128GB108__)

#include "devices/pic24fj128gb108_pyports.h"

#elif defined(__PIC24FJ128GB110__)

#include "devices/pic24fj128gb110_pyports.h"

#elif defined(__PIC24FJ16GA002__)

#include "devices/pic24fj16ga002_pyports.h"

#elif defined(__PIC24FJ16GA004__)

#include "devices/pic24fj16ga004_pyports.h"

#elif defined(__PIC24FJ192GA106__)

#include "devices/pic24fj192ga106_pyports.h"

#elif defined(__PIC24FJ192GA108__)

#include "devices/pic24fj192ga108_pyports.h"

#elif defined(__PIC24FJ192GA110__)

#include "devices/pic24fj192ga110_pyports.h"

#elif defined(__PIC24FJ192GB106__)

#include "devices/pic24fj192gb106_pyports.h"

#elif defined(__PIC24FJ192GB108__)

#include "devices/pic24fj192gb108_pyports.h"

#elif defined(__PIC24FJ192GB110__)

#include "devices/pic24fj192gb110_pyports.h"

#elif defined(__PIC24FJ256GA106__)

#include "devices/pic24fj256ga106_pyports.h"

#elif defined(__PIC24FJ256GA108__)

#include "devices/pic24fj256ga108_pyports.h"

#elif defined(__PIC24FJ256GA110__)

#include "devices/pic24fj256ga110_pyports.h"

#elif defined(__PIC24FJ256GB106__)

#include "devices/pic24fj256gb106_pyports.h"

#elif defined(__PIC24FJ256GB108__)

#include "devices/pic24fj256gb108_pyports.h"

#elif defined(__PIC24FJ256GB110__)

#include "devices/pic24fj256gb110_pyports.h"

#elif defined(__PIC24FJ32GA002__)

#include "devices/pic24fj32ga002_pyports.h"

#elif defined(__PIC24FJ32GA004__)

#include "devices/pic24fj32ga004_pyports.h"

#elif defined(__PIC24FJ48GA002__)

#include "devices/pic24fj48ga002_pyports.h"

#elif defined(__PIC24FJ48GA004__)

#include "devices/pic24fj48ga004_pyports.h"

#elif defined(__PIC24FJ64GA002__)

#include "devices/pic24fj64ga002_pyports.h"

#elif defined(__PIC24FJ64GA004__)

#include "devices/pic24fj64ga004_pyports.h"

#elif defined(__PIC24FJ64GA006__)

#include "devices/pic24fj64ga006_pyports.h"

#elif defined(__PIC24FJ64GA008__)

#include "devices/pic24fj64ga008_pyports.h"

#elif defined(__PIC24FJ64GA010__)

#include "devices/pic24fj64ga010_pyports.h"

#elif defined(__PIC24FJ64GA106__)

#include "devices/pic24fj64ga106_pyports.h"

#elif defined(__PIC24FJ64GA108__)

#include "devices/pic24fj64ga108_pyports.h"

#elif defined(__PIC24FJ64GA110__)

#include "devices/pic24fj64ga110_pyports.h"

#elif defined(__PIC24FJ64GB106__)

#include "devices/pic24fj64gb106_pyports.h"

#elif defined(__PIC24FJ64GB108__)

#include "devices/pic24fj64gb108_pyports.h"

#elif defined(__PIC24FJ64GB110__)

#include "devices/pic24fj64gb110_pyports.h"

#elif defined(__PIC24FJ96GA006__)

#include "devices/pic24fj96ga006_pyports.h"

