jsnyder/python-on-a-chip/src/platform/pic24/common/pic24_pyports.c
#elif defined(__dsPIC33FJ64GP306__)

#include "devices/dspic33fj64gp306_pyports.h"

#elif defined(__dsPIC33FJ64GP310A__)

#include "devices/dspic33fj64gp310a_pyports.h"

#elif defined(__dsPIC33FJ64GP310__)

#include "devices/dspic33fj64gp310_pyports.h"

#elif defined(__dsPIC33FJ64GP706A__)

#include "devices/dspic33fj64gp706a_pyports.h"

#elif defined(__dsPIC33FJ64GP706__)

#include "devices/dspic33fj64gp706_pyports.h"

#elif defined(__dsPIC33FJ64GP708A__)

#include "devices/dspic33fj64gp708a_pyports.h"

#elif defined(__dsPIC33FJ64GP708__)

#include "devices/dspic33fj64gp708_pyports.h"

#elif defined(__dsPIC33FJ64GP710A__)

#include "devices/dspic33fj64gp710a_pyports.h"

#elif defined(__dsPIC33FJ64GP710__)

#include "devices/dspic33fj64gp710_pyports.h"

#elif defined(__dsPIC33FJ64GP802__)

#include "devices/dspic33fj64gp802_pyports.h"

#elif defined(__dsPIC33FJ64GP804__)

#include "devices/dspic33fj64gp804_pyports.h"

#elif defined(__dsPIC33FJ64GS406__)

#include "devices/dspic33fj64gs406_pyports.h"

#elif defined(__dsPIC33FJ64GS606__)

#include "devices/dspic33fj64gs606_pyports.h"

#elif defined(__dsPIC33FJ64GS608__)

#include "devices/dspic33fj64gs608_pyports.h"

#elif defined(__dsPIC33FJ64GS610__)

#include "devices/dspic33fj64gs610_pyports.h"

#elif defined(__dsPIC33FJ64MC202__)

#include "devices/dspic33fj64mc202_pyports.h"

#elif defined(__dsPIC33FJ64MC204__)

#include "devices/dspic33fj64mc204_pyports.h"

#elif defined(__dsPIC33FJ64MC506A__)

#include "devices/dspic33fj64mc506a_pyports.h"

#elif defined(__dsPIC33FJ64MC506__)

#include "devices/dspic33fj64mc506_pyports.h"

#elif defined(__dsPIC33FJ64MC508A__)

#include "devices/dspic33fj64mc508a_pyports.h"

#elif defined(__dsPIC33FJ64MC508__)

#include "devices/dspic33fj64mc508_pyports.h"

#elif defined(__dsPIC33FJ64MC510A__)

#include "devices/dspic33fj64mc510a_pyports.h"

#elif defined(__dsPIC33FJ64MC510__)

#include "devices/dspic33fj64mc510_pyports.h"

#elif defined(__dsPIC33FJ64MC706A__)

#include "devices/dspic33fj64mc706a_pyports.h"

#elif defined(__dsPIC33FJ64MC706__)

#include "devices/dspic33fj64mc706_pyports.h"

#elif defined(__dsPIC33FJ64MC710A__)

#include "devices/dspic33fj64mc710a_pyports.h"

#elif defined(__dsPIC33FJ64MC710__)

#include "devices/dspic33fj64mc710_pyports.h"

#elif defined(__dsPIC33FJ64MC802__)

#include "devices/dspic33fj64mc802_pyports.h"

#elif defined(__dsPIC33FJ64MC804__)

#include "devices/dspic33fj64mc804_pyports.h"

#else

#error -- processor ID not specified in pic24_pyports.h

#endif


#ifndef _PIC24_PYDIGIO_DEFINED
#warning Digital IO macros not defined for this device!
#warning Edit common\pic24_pyports.h file!
#endif








/** The values state that a given digital I/O pin does not 
 *  have analog capability. It is used in \ref anCnMap.
 */
#define UNDEF_AN_PIN 255

/** The values state that a given digital I/O pin does not 
 *  have change notification capability. It is used in \ref anCnMap.
 */
#define UNDEF_CN_PIN 255

/** Define a structure which contains a mapping from
 *  a digital I/O port/pin to an analog pin and to
 *  a change notification pin.
 */
typedef struct {
  /// The analog pin (ANxx) corresponding to a given digital port/pin,
  /// or \ref UNDEF_AN_PIN if the pin has no analog capability.
  uint8_t u8_anPin;
  /// The analog pin (ANxx) corresponding to a given digital port/pin,
  /// or \ref UNDEF_CN_PIN if the pin has no change notification capability.
  uint8_t u8_cnPin;
} anCnMap_t;

// The AN_CN_MAP macro specifies the mapping. It is defined in
// the device/<devicename>_pyports.h file.
/** An array of the \ref anCnMap_t structure with an entry for each of
 *  the (up to) 16 pins on each digitial I/O port for this device.
 */
static const anCnMap_t anCnMap[NUM_DIGITAL_PORTS * 16] = { AN_CN_MAP };

#if defined(HAS_REMAPPABLE_PINS) || defined(__DOXYGEN__)
/** This bitfield indicates which remappable pins exist on this device.
 *  Each bit is true if the corresponding remappable pin exists.
 *  In particular, bit 0 = RP0, bit 1 = RP1, etc.
 */
static const uint32_t u32_isRemappable = {
#ifdef _RP0R
    0x00000001 |
#endif
#ifdef _RP1R
    0x00000002 |
#endif
#ifdef _RP2R
    0x00000004 |
#endif
#ifdef _RP3R
    0x00000008 |
#endif
#ifdef _RP4R
    0x00000010 |
#endif
#ifdef _RP5R
    0x00000020 |
#endif
#ifdef _RP6R
    0x00000040 |
#endif
#ifdef _RP7R
    0x00000080 |
#endif
#ifdef _RP8R
    0x00000100 |
#endif
#ifdef _RP9R
    0x00000200 |
#endif
#ifdef _RP10R
    0x00000400 |
#endif
#ifdef _RP11R
    0x00000800 |
#endif
#ifdef _RP12R
    0x00001000 |
#endif
#ifdef _RP13R
    0x00002000 |
#endif
#ifdef _RP14R
    0x00004000 |
#endif
#ifdef _RP15R
    0x00008000 |
#endif
#ifdef _RP16R
    0x00010000 |
#endif
#ifdef _RP17R
    0x00020000 |
#endif
#ifdef _RP18R
    0x00040000 |
#endif
#ifdef _RP19R
    0x00080000 |
#endif
#ifdef _RP20R
    0x00100000 |
#endif
#ifdef _RP21R
    0x00200000 |
#endif
#ifdef _RP22R
    0x00400000 |
#endif
#ifdef _RP23R
    0x00800000 |
#endif
#ifdef _RP24R
    0x01000000 |
#endif
#ifdef _RP25R
    0x02000000 |
#endif
#ifdef _RP26R
    0x04000000 |
#endif
#ifdef _RP27R
    0x08000000 |
#endif
#ifdef _RP28R
    0x10000000 |
#endif
#ifdef _RP29R
    0x20000000 |
#endif
#ifdef _RP30R
    0x40000000 |
#endif
// Note: RP31R can't exist, since this value is reserved
// for assigning an input to Vss.
    0x00000000 
};
#endif





/** Make sure the given pin is within bounds.
 *  @param u16_port Port, where 0 = A, 1 = B, etc.
 *  @param u16_pin  Pin of the given port; from 0 to 15.
 *  @return Returns C_FALSE if the port exceeds \ref NUM_DIGITAL_PORTS
 *          or if the pin > 15. Returns C_TRUE otherwise.
 */
inline __STATIC__ bool_t digitalPinInBounds(uint16_t u16_port, uint16_t u16_pin)
{
    // Check for an out-of-range port
    if (u16_port >= NUM_DIGITAL_PORTS)
        return C_FALSE;
    // Check for an out-of-range pin
    if (u16_pin > 15)
        return C_FALSE;
    else
        return C_TRUE;
}

bool_t 
digitalPinExists(uint16_t u16_port, uint16_t u16_pin)
{
    // Check for an out-of-range port
    if (!digitalPinInBounds(u16_port, u16_pin))
        return C_FALSE;
    // Check the map of pins.
    return getBit(u16_digitalPinPresent[u16_port], u16_pin);
}


/** Determine if the given digitial I/O open-drain pin exists.
 *  @param u16_port Port, where 0 = A, 1 = B, etc.
 *  @param u16_pin  Pin of the given port; from 0 to 15.
 *  @return Returns C_TRUE if the pin open-drain exists, C_FALSE otherwise.
 *          Nonexistant ports or pins simply return C_FALSE.
 */
__STATIC__ bool_t
digitalOpenDrainPinExists(uint16_t u16_port, uint16_t u16_pin)
{
    // Check for an out-of-range port
    if (!digitalPinInBounds(u16_port, u16_pin))
        return C_FALSE;
    // Check the map of pins.
    return getBit(u16_digitalPinOpenDrainPresent[u16_port], u16_pin);
}


/** This values gives the number of words between I/O port control registers.
 *  For example, &TRISA = 0x02C0 and &TRISB = 0x2C8, a difference of
 *  four words. 
 */
// Note: I can't make this a const, since only the linker knows these values.
// E.g. the statement below produces a compile error:
// static const u16_ioPortControlOffset = (uint16_t) (&TRISB - &TRISA);
#define IO_PORT_CONTROL_OFFSET 4

PmReturn_t
setPinIsInput(uint16_t u16_port, uint16_t u16_pin, bool_t b_isInput)
{
    PmReturn_t retval = PM_RET_OK;

    EXCEPTION_UNLESS(digitalPinExists(u16_port, u16_pin), PM_RET_EX_VAL,
      "Invalid pin %c%d.", (char) (u16_port + 'A'), u16_pin);
    // Select input or output for the pin
    setBit((&TRISA) + u16_port*IO_PORT_CONTROL_OFFSET, u16_pin, b_isInput);
    return retval;
}


PmReturn_t
getPinIsInput(uint16_t u16_port, uint16_t u16_pin, bool_t* pb_isInput)
{
    PmReturn_t retval = PM_RET_OK;

    EXCEPTION_UNLESS(digitalPinExists(u16_port, u16_pin), PM_RET_EX_VAL,
      "Invalid pin %c%d.", (char) (u16_port + 'A'), u16_pin);
    // Determine if pin is an input or an output
    *pb_isInput = getBit(*((&TRISA) + u16_port*IO_PORT_CONTROL_OFFSET), u16_pin);
    return retval;
}


PmReturn_t
setPinIsDigital(uint16_t u16_port, uint16_t u16_pin, 
  bool_t b_isDigital)
{
    PmReturn_t retval = PM_RET_OK;
    uint8_t u8_anPin;

    EXCEPTION_UNLESS(digitalPinExists(u16_port, u16_pin), PM_RET_EX_VAL,
      "Invalid pin %c%d.", (char) (u16_port + 'A'), u16_pin);

    // There are four possibilities for digital configuration:
    //                      | set as analog   | set as digital
    // ---------------------+-----------------+-----------------------------------------
    // has analog           | clear PCFG bit  | set PCFG bit
    // does not have analog | throw exception | do nothing (already digital)
    u8_anPin = anCnMap[u16_port*16 + u16_pin].u8_anPin;
    if (u8_anPin != UNDEF_AN_PIN) {
        // Enable/disable analog input mode on this pin.
        // Each ADC handles 32 channels; some PIC24F / dsPIC33 parts have
        // two converters. If so, need to clear the corresponding bit on both.
        SET_EXTENDED_BIT(&AD1PCFGL, u8_anPin, b_isDigital);
#ifdef _AD2IF
        SET_EXTENDED_BIT(&AD2PCFGL, u8_anPin, b_isDigital);
#endif
    } else {
        // If analog is enabled on a pin without analog ability,
        // report an error. Otherwise, do nothing -- digital
        // is the default for a pin without analog ability.
        EXCEPTION_UNLESS(b_isDigital, PM_RET_EX_VAL,
          "Pin %c%d does not support analog functionality.", 
          (char) (u16_port + 'A'), u16_pin);
    }

    return retval;
}


PmReturn_t
setPinIsOpenDrain(uint16_t u16_port, uint16_t u16_pin, bool_t b_isOpenDrain)
{
    PmReturn_t retval = PM_RET_OK;

    EXCEPTION_UNLESS(digitalPinExists(u16_port, u16_pin), PM_RET_EX_VAL,
      "Invalid pin %c%d.", (char) (u16_port + 'A'), u16_pin);
    // There are four possibilities for open-drain configuration:
    //                          | set as open-drain  | set as normal (push/pull aka totem-pole)
    // -------------------------+--------------------+-----------------------------------------
    // has open-drain           | set OD bit         | clear OD bit
    // does not have open-drain | throw exception    | do nothing (already normal)
    if (digitalOpenDrainPinExists(u16_port, u16_pin)) {
        // Set the pin per the OD boolean.
        // PIC24F names this differently, so define around it.
        #if defined (_ODA0)  || defined (_ODA1)  || defined (_ODA2)  || defined (_ODA3)  || \
            defined (_ODA4)  || defined (_ODA5)  || defined (_ODA6)  || defined (_ODA7)  || \
            defined (_ODA8)  || defined (_ODA9)  || defined (_ODA10) || defined (_ODA11) || \
            defined (_ODA12) || defined (_ODA12) || defined (_ODA14) || defined (_ODA15)
        #define ODCA ODA
        #endif
        setBit((&ODCA) + u16_port*IO_PORT_CONTROL_OFFSET, u16_pin, b_isOpenDrain);
    } else {
        // If open-drain is enabled on a pin without OD ability,
        // report an error. Otherwise, do nothing -- open-drain
        // is already disabled for a pin without OD ability.
        EXCEPTION_UNLESS(!b_isOpenDrain, PM_RET_EX_VAL,
          "The pin %c%d has no open-drain ability.", (char) (u16_port + 'A'), u16_pin);
    }

    return retval;
}

PmReturn_t
setPinPullDirection(uint16_t u16_port, uint16_t u16_pin, 
  int16_t i16_dir)
{
    PmReturn_t retval = PM_RET_OK;
    uint8_t u8_cnPin;

    EXCEPTION_UNLESS(digitalPinExists(u16_port, u16_pin), PM_RET_EX_VAL,
      "Invalid pin %c%d.", (char) (u16_port + 'A'), u16_pin);

    // Detetrmine which (if any) CN bit exists on the given pin
    u8_cnPin = anCnMap[u16_port*16 + u16_pin].u8_cnPin;

    // For no pull, disable pull-ups and pull-downs if they exist
    if (i16_dir == 0) {
        if (u8_cnPin != UNDEF_CN_PIN) {
            SET_EXTENDED_BIT(&CNPU1, u8_cnPin, C_FALSE);
            #ifdef HAS_PULL_DOWNS
                SET_EXTENDED_BIT(&CNPD1, u8_cnPin, C_FALSE);
            #endif
        }
    // For pull-ups, disable pull-downs if they exist. Throw
    // an exception if pull-ups don't exist
    } else if (i16_dir > 0) {
        EXCEPTION_UNLESS(u8_cnPin != UNDEF_CN_PIN, PM_RET_EX_VAL,
          "Pull-ups do not exist on %c%d.", 
          (char) (u16_port + 'A'), u16_pin);
        SET_EXTENDED_BIT(&CNPU1, u8_cnPin, C_TRUE);
        #ifdef HAS_PULL_DOWNS
            SET_EXTENDED_BIT(&CNPD1, u8_cnPin, C_FALSE);
        #endif
    // For pull-downs, disable pull-ups. Throw an exception
    // if either don't exist.
    } else {
        ASSERT(i16_dir < 0);

        // Verify pull-downs exist then enable them
        #ifdef HAS_PULL_DOWNS
            SET_EXTENDED_BIT(&CNPD1, u8_cnPin, C_TRUE);
        #else
            EXCEPTION_UNLESS(0, PM_RET_EX_VAL,
              "Pull-downs do not exist on this chip.");
        #endif

        // Verify pull-ups exist then disable them
        EXCEPTION_UNLESS(u8_cnPin != UNDEF_CN_PIN, PM_RET_EX_VAL,
          "Pull-ups do not exist on %c%d.", 
          (char) (u16_port + 'A'), u16_pin);
        SET_EXTENDED_BIT(&CNPU1, u8_cnPin, C_FALSE);
    }

    return retval;
}

#ifdef HAS_REMAPPABLE_PINS

